Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest
Represents a request to create a new BIM model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Name
Gets or sets the name of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Type
Gets or sets the type of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.OrganizationId
Gets or sets the organization identifier associated with the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.SchemaVersion
Gets or sets the schema version of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.VersionName
Gets or sets the name of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Format
Gets or sets the format of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.AccessControlList
Gets or sets the additional access control list entries to be added to the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Tags
Gets or sets the list of tags associated with the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Metadata
Gets or sets the metadata for the model as key-value pairs.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Author
Gets or sets the author information of the initial version as key-value pairs.
Remarks:
This metadata is for display and reference purposes only.
It does not affect access control or ownership, and no verification is performed.
For optimal compatibility with certain applications, please use the recommended keys to ensure proper integration
- authorDisplayName: The display name of the user who created the version.
- organizationDisplayName: The display name of the organization associated with the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest.Comment
Gets or sets an optional comment for the model.